Tekla.Structures.Analysis.AnalysisPartPositionProperties
The AnalysisPartPositionProperties class contains information related to analysis part position properties.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._AxisLocation
The axis location of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._AxisModifierX
The axis modifier in X direction of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._AxisCoordinateX
The axis coordinate in X direction of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._AxisModifierY
The axis modifier in Y direction of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._AxisCoordinateY
The axis coordinate in X direction of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._AxisModifierZ
The axis modifier in Z direction of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._AxisCoordinateZ
The axis coordinate in X direction of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._AxisOffset
The axis offset of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._KeepAxis
The keep axis setting of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties._LongitudinalOffsetMode
The longitudinal offset mode.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocation
The axis location of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisModifierX
The axis modifier in the X direction.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisCoordinateX
The axis coordinate in the X direction.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisModifierY
The axis modifier in the Y direction.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisCoordinateY
The axis coordinate in the Y direction.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisModifierZ
The axis modifier in the Z direction.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisCoordinateZ
The axis coordinate in the Z direction.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisOffset
The axis offset of the analysis part (in the global coordinate system).

Tekla.Structures.Analysis.AnalysisPartPositionProperties.KeepAxis
The keep axis setting of the analysis part.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.LongitudinalOffsetMode
The longitudinal offset mode.